# 1. Берем официальный образ Node.js версии 20 (текущий стандарт)
# 'slim' означает, что образ легкий и в нем нет лишнего мусора
FROM node:20-slim

# 2. Создаем внутри контейнера папку /app, где будет лежать наш код
WORKDIR /app

# 3. Копируем файлы package.json и package-lock.json
# Мы делаем это отдельно, чтобы Docker закешировал установку библиотек
COPY package*.json ./

# 4. Устанавливаем все зависимости
RUN npm install

# 5. Копируем все остальные файлы нашего проекта в контейнер
COPY . .

# 6. Команда по умолчанию (пока просто выведем версию node)
CMD ["node", "-v"]
